<?php
// РџСЂРёРјРµСЂ СЂР°Р±РѕС‚С‹ СЃ РєР»Р°СЃСЃРѕРј SxGeo v2.2
header('Content-type: text/plain; charset=utf8');

// РџРѕРґРєР»СЋС‡Р°РµРј SxGeo.php РєР»Р°СЃСЃ
include("SxGeo.php");
// РЎРѕР·РґР°РµРј РѕР±СЉРµРєС‚
// РџРµСЂРІС‹Р№ РїР°СЂР°РјРµС‚СЂ - РёРјСЏ С„Р°Р№Р»Р° СЃ Р±Р°Р·РѕР№ (РёСЃРїРѕР»СЊР·СѓРµС‚СЃСЏ РѕСЂРёРіРёРЅР°Р»СЊРЅР°СЏ Р±РёРЅР°СЂРЅР°СЏ Р±Р°Р·Р° SxGeo.dat)
// Р’С‚РѕСЂРѕР№ РїР°СЂР°РјРµС‚СЂ - СЂРµР¶РёРј СЂР°Р±РѕС‚С‹: 
//     SXGEO_FILE   (СЂР°Р±РѕС‚Р° СЃ С„Р°Р№Р»РѕРј Р±Р°Р·С‹, СЂРµР¶РёРј РїРѕ СѓРјРѕР»С‡Р°РЅРёСЋ); 
//     SXGEO_BATCH (РїР°РєРµС‚РЅР°СЏ РѕР±СЂР°Р±РѕС‚РєР°, СѓРІРµР»РёС‡РёРІР°РµС‚ СЃРєРѕСЂРѕСЃС‚СЊ РїСЂРё РѕР±СЂР°Р±РѕС‚РєРµ РјРЅРѕР¶РµСЃС‚РІР° IP Р·Р° СЂР°Р·)
//     SXGEO_MEMORY (РєСЌС€РёСЂРѕРІР°РЅРёРµ Р‘Р” РІ РїР°РјСЏС‚Рё, РµС‰Рµ СѓРІРµР»РёС‡РёРІР°РµС‚ СЃРєРѕСЂРѕСЃС‚СЊ РїР°РєРµС‚РЅРѕР№ РѕР±СЂР°Р±РѕС‚РєРё, РЅРѕ С‚СЂРµР±СѓРµС‚ Р±РѕР»СЊС€Рµ РїР°РјСЏС‚Рё)
$SxGeo = new SxGeo('SxGeoCity.dat');
//$SxGeo = new SxGeo('SxGeoCity.dat', SXGEO_BATCH | SXGEO_MEMORY); // РЎР°РјС‹Р№ РїСЂРѕРёР·РІРѕРґРёС‚РµР»СЊРЅС‹Р№ СЂРµР¶РёРј, РµСЃР»Рё РЅСѓР¶РЅРѕ РѕР±СЂР°Р±РѕС‚Р°С‚СЊ РјРЅРѕРіРѕ IP Р·Р° СЂР°Р·

$ip = $_SERVER['REMOTE_ADDR'];

var_export($SxGeo->getCityFull($ip)); // Р’СЃСЏ РёРЅС„РѕСЂРјР°С†РёСЏ Рѕ РіРѕСЂРѕРґРµ
var_export($SxGeo->get($ip));         // РљСЂР°С‚РєР°СЏ РёРЅС„РѕСЂРјР°С†РёСЏ Рѕ РіРѕСЂРѕРґРµ РёР»Рё РєРѕРґ СЃС‚СЂР°РЅС‹ (РµСЃР»Рё РёСЃРїРѕР»СЊР·СѓРµС‚СЃСЏ Р±Р°Р·Р° SxGeo Country)
var_export($SxGeo->about());          // Р�РЅС„РѕСЂРјР°С†РёСЏ Рѕ Р±Р°Р·Рµ РґР°РЅРЅС‹С…
